# Dotfiles Brewfile - Core packages
# Run: brew bundle --file=~/dotfile-mac/Brewfile

# ------------------------------------------------------------------------------
# Terminals
# ------------------------------------------------------------------------------

cask "ghostty"

# ------------------------------------------------------------------------------
# Development Tools
# ------------------------------------------------------------------------------

brew "git"
brew "git-delta"            # Better git diffs
brew "git-lfs"              # Large file storage
brew "gh"                   # GitHub CLI
brew "neovim"               # Editor
brew "tmux"                 # Terminal multiplexer
brew "mise"                 # Version manager (replaces asdf)
brew "uv"                   # Fast Python package installer (uses mise Python)
brew "lazygit"              # Terminal UI for git

# ------------------------------------------------------------------------------
# Search & Navigation
# ------------------------------------------------------------------------------

brew "fzf"                  # Fuzzy finder
brew "fd"                   # Fast find alternative
brew "ripgrep"              # Fast grep alternative

# ------------------------------------------------------------------------------
# Shell & Prompt
# ------------------------------------------------------------------------------

brew "starship"             # Cross-shell prompt
brew "atuin"                # Shell history

# ------------------------------------------------------------------------------
# Utilities
# ------------------------------------------------------------------------------

brew "jq"                   # JSON processor
brew "gum"                  # Shell script UI components
brew "trash"                # Move files to trash (safer rm)

# ------------------------------------------------------------------------------
# Languages (dependencies for mise-installed languages)
# ------------------------------------------------------------------------------

brew "openssl"
brew "readline"
brew "libyaml"
brew "gmp"

# ------------------------------------------------------------------------------
# Fonts
# ------------------------------------------------------------------------------

cask "font-martian-mono-nerd-font"
