# Dotfiles Brewfile - Core packages
# Run: brew bundle --file=~/dotfile-mac/Brewfile

# ------------------------------------------------------------------------------
# Terminals
# ------------------------------------------------------------------------------

cask "ghostty"

# ------------------------------------------------------------------------------
# Development Tools
# ------------------------------------------------------------------------------

brew "git"
brew "git-delta"            # Better git diffs
brew "diffnav"              # TUI file navigator for diffs
brew "git-lfs"              # Large file storage
brew "gh"                   # GitHub CLI
brew "neovim"               # Editor
brew "tmux"                 # Terminal multiplexer
brew "mise"                 # Version manager (replaces asdf)
brew "direnv"               # Per-directory environment variables
brew "uv"                   # Fast Python package installer (uses mise Python)
brew "lazygit"              # Terminal UI for git
brew "worktrunk"            # Git worktree manager for AI agents
brew "sesh"                 # Tmux session manager with fzf integration
brew "agent-browser"        # Browser automation CLI for AI agents
brew "gitmux"               # Git status in tmux status bar

# ------------------------------------------------------------------------------
# Search & Navigation
# ------------------------------------------------------------------------------

brew "fzf"                  # Fuzzy finder
brew "fd"                   # Fast find alternative
brew "ripgrep"              # Fast grep alternative
brew "eza"                  # Modern ls replacement

# ------------------------------------------------------------------------------
# Shell & Prompt
# ------------------------------------------------------------------------------

brew "starship"             # Cross-shell prompt
brew "atuin"                # Shell history

# ------------------------------------------------------------------------------
# Utilities
# ------------------------------------------------------------------------------

brew "gnupg"                # GPG signing
brew "jq"                   # JSON processor
brew "gum"                  # Shell script UI components
brew "trash"                # Move files to trash (safer rm)
brew "yt-dlp"               # Video downloader

# ------------------------------------------------------------------------------
# Languages (dependencies for mise-installed languages)
# ------------------------------------------------------------------------------

brew "openssl"
brew "readline"
brew "libyaml"
brew "gmp"

# ------------------------------------------------------------------------------
# Fonts
# ------------------------------------------------------------------------------

cask "font-jetbrains-mono-nerd-font"
